iwasz/mcuxsdk-middleware-bootloader/src/property/src/property_kinetis_MKE17Z512.c
#if BL_HAS_SECONDARY_INTERNAL_FLASH
        g_bootloaderContext.flashDriverInterface->flash_get_property(
            g_bootloaderContext.allFlashState, kFLASH_PropertyPflash1BlockBaseAddr,
            &propertyStore->flashStartAddress[kFlashIndex_Secondary]);
        g_bootloaderContext.flashDriverInterface->flash_get_property(
            g_bootloaderContext.allFlashState, kFLASH_PropertyPflash1TotalSize,
            &propertyStore->flashSizeInBytes[kFlashIndex_Secondary]);
        g_bootloaderContext.flashDriverInterface->flash_get_property(
            g_bootloaderContext.allFlashState, kFLASH_PropertyPflash1SectorSize,
            &propertyStore->flashSectorSize[kFlashIndex_Secondary]);
        g_bootloaderContext.flashDriverInterface->flash_get_property(
            g_bootloaderContext.allFlashState, kFLASH_PropertyPflash1BlockSize,
            &propertyStore->flashBlockSize[kFlashIndex_Secondary]);
        g_bootloaderContext.flashDriverInterface->flash_get_property(
            g_bootloaderContext.allFlashState, kFLASH_PropertyPflash1BlockCount,
            &propertyStore->flashBlockCount[kFlashIndex_Secondary]);
        g_bootloaderContext.flashDriverInterface->flash_get_property(
            g_bootloaderContext.allFlashState, kFLASH_PropertyPflash1FacSupport,
            &propertyStore->flashFacSupport[kFlashIndex_Secondary]);
        g_bootloaderContext.flashDriverInterface->flash_get_property(
            g_bootloaderContext.allFlashState, kFLASH_PropertyPflash1AccessSegmentSize,
            &propertyStore->flashAccessSegmentSize[kFlashIndex_Secondary]);
        g_bootloaderContext.flashDriverInterface->flash_get_property(
            g_bootloaderContext.allFlashState, kFLASH_PropertyPflash1AccessSegmentCount,
            &propertyStore->flashAccessSegmentCount[kFlashIndex_Secondary]);
#endif
#if BL_FEATURE_SUPPORT_DFLASH
        if (g_bootloaderContext.dflashDriverInterface != NULL)
        {
            g_bootloaderContext.dflashDriverInterface->flash_get_property(
                g_bootloaderContext.dFlashState, kFLEXNVM_PropertyDflashBlockBaseAddr,
                &propertyStore->flashStartAddress[kFalshIndex_DFlash]);
            g_bootloaderContext.dflashDriverInterface->flash_get_property(
                g_bootloaderContext.dFlashState, kFLEXNVM_PropertyDflashTotalSize,
                &propertyStore->flashSizeInBytes[kFalshIndex_DFlash]);
            g_bootloaderContext.dflashDriverInterface->flash_get_property(
                g_bootloaderContext.dFlashState, kFLEXNVM_PropertyDflashSectorSize,
                &propertyStore->flashSectorSize[kFalshIndex_DFlash]);
            g_bootloaderContext.dflashDriverInterface->flash_get_property(
                g_bootloaderContext.dFlashState, kFLEXNVM_PropertyDflashBlockSize,
                &propertyStore->flashBlockSize[kFalshIndex_DFlash]);
            g_bootloaderContext.dflashDriverInterface->flash_get_property(
                g_bootloaderContext.dFlashState, kFLEXNVM_PropertyDflashBlockCount,
                &propertyStore->flashBlockCount[kFalshIndex_DFlash]);

            //        g_bootloaderContext.dflashDriverInterface->flash_get_property(g_bootloaderContext.dFlashState,
            //                                                                      kFLEXNVM_PropertyFlexRamBlockBaseAddr,
            //                                                                     &propertyStore->flashSectorSize[kFalshIndex_DFlash]);
            //        g_bootloaderContext.dflashDriverInterface->flash_get_property(g_bootloaderContext.dFlashState,
            //                                                                      kFLEXNVM_PropertyFlexRamTotalSize,
            //                                                                     &propertyStore->flashSectorSize[kFalshIndex_DFlash]);
            //        g_bootloaderContext.dflashDriverInterface->flash_get_property(g_bootloaderContext.dFlashState,
            //                                                                      kFLEXNVM_PropertyEepromTotalSize,
            //                                                                     &propertyStore->flashSectorSize[kFalshIndex_DFlash]);
        }
#endif //  BL_FEATURE_SUPPORT_DFLASH
    }
#endif // #if !BL_FEATURE_HAS_NO_INTERNAL_FLASH
    
#endif // if defined(BL_TARGET_FLASH)

    // Fill in reserved regions.
    //! @todo Support other tool chain

    uint32_t flashStart = 0;
    uint32_t flashEnd = 0;
    uint32_t ramStart = 0;
    uint32_t ramEnd = 0;

#if !BL_FEATURE_HAS_NO_INTERNAL_FLASH
#if !BL_TARGET_FLASH
    flashStart = (&g_bootloaderContext.memoryMap[kIndexFlashArray])->startAddress;
    flashEnd = (&g_bootloaderContext.memoryMap[kIndexFlashArray])->startAddress;
#else
    flashStart = __ROM_START;
    flashEnd = __ROM_END;
    assert(flashEnd);

    // Force flash erase size alignment.
    // Note: Assume that flash-resident bootloader is always in Main flash.
    flashStart = ALIGN_DOWN(flashStart, propertyStore->flashSectorSize[kFlashIndex_Main]);
    flashEnd = ALIGN_UP(flashEnd, propertyStore->flashSectorSize[kFlashIndex_Main]) - 1;
#endif
#endif // #if !BL_FEATURE_HAS_NO_INTERNAL_FLASH
    ramStart = __RAM_START;
    ramEnd = __RAM_END;
    assert(ramEnd);

    propertyStore->reservedRegions[kProperty_FlashReservedRegionIndex].startAddress = flashStart;
    propertyStore->reservedRegions[kProperty_FlashReservedRegionIndex].endAddress = flashEnd;
    propertyStore->reservedRegions[kProperty_RamReservedRegionIndex].startAddress = ramStart;
    propertyStore->reservedRegions[kProperty_RamReservedRegionIndex].endAddress = ramEnd;

#if 0
    // Fill in available peripherals array.
    const peripheral_descriptor_t *peripherals = g_bootloaderContext.allPeripherals;
    propertyStore->availablePeripherals = 0;
    for (uint32_t i = 0; peripherals[i].typeMask != 0; ++i)
    {
        // Check that the peripheral is enabled in the user configuration data.
        if (propertyStore->configurationData.enabledPeripherals & peripherals[i].typeMask)
        {
            propertyStore->availablePeripherals |= peripherals[i].typeMask;
        }
    }
#endif // if 0
    
#if defined(BL_TARGET_FLASH)
// Fill in unique device id value.
// Different series have different length of UID (K series=128 bits, KL series=80 bits)
#if (!FSL_FEATURE_SIM_HAS_NO_UID) && defined(SIM)
#if defined(SIM_UIDH) | defined(SIM_UIDH_UID) | defined(SIM_UIDH_UID127_96)
#if defined(SIM_UIDM_UID)
    propertyStore->UniqueDeviceId.uid[2] = SIM->UIDH;
#else
    propertyStore->UniqueDeviceId.uid[3] = SIM->UIDH;
#endif
#endif
#if defined(SIM_UIDM_UID)
    propertyStore->UniqueDeviceId.uid[1] = SIM->UIDM;
#else
    propertyStore->UniqueDeviceId.uid[2] = SIM->UIDMH;
    propertyStore->UniqueDeviceId.uid[1] = SIM->UIDML;
#endif // defined(SIM_UIDM)
    propertyStore->UniqueDeviceId.uid[0] = SIM->UIDL;
#endif // #if !FSL_FEATURE_SIM_HAS_NO_UID
      
    
    // Set address range of RAM in property interface
    const memory_map_entry_t *map = (memory_map_entry_t *)&g_bootloaderContext.memoryMap[kIndexSRAM];
    propertyStore->ramStartAddress[kPropertyIndex_SRAM] = map->startAddress;
    propertyStore->ramSizeInBytes[kPropertyIndex_SRAM] = map->endAddress - map->startAddress + 1;
#if defined(K28F15_SERIES)
    map = (memory_map_entry_t *)&g_bootloaderContext.memoryMap[kIndexOCRAM];
    propertyStore->ramStartAddress[kPropertyIndex_OCRAM] = map->startAddress;
    propertyStore->ramSizeInBytes[kPropertyIndex_OCRAM] = map->endAddress - map->startAddress + 1;
#elif defined(KV58F24_SERIES)
    map = (memory_map_entry_t *)&g_bootloaderContext.memoryMap[kIndexDTCM];
    propertyStore->ramStartAddress[kPropertyIndex_DTCM] = map->startAddress;
    propertyStore->ramSizeInBytes[kPropertyIndex_DTCM] = map->endAddress - map->startAddress + 1;
    map = (memory_map_entry_t *)&g_bootloaderContext.memoryMap[kIndexOCRAM];
    propertyStore->ramStartAddress[kPropertyIndex_OCRAM] = map->startAddress;
    if (map->startAddress == map->endAddress)
    {
        propertyStore->ramSizeInBytes[kPropertyIndex_OCRAM] = 0;
    }
    else
    {
        propertyStore->ramSizeInBytes[kPropertyIndex_OCRAM] = map->endAddress - map->startAddress + 1;
    }
#endif // defined(K28F15_SERIES)
#endif // defined(BL_TARGET_FLASH)

#if BL_FEATURE_CRC_CHECK
    // Initialize crc check status property based on BCA related fields.
    init_crc_check_status(propertyStore);
#endif

#if !BL_FEATURE_HAS_NO_INTERNAL_FLASH
    // Fill in default margin level.
    propertyStore->flashReadMargin = (uint32_t)kFTFx_MarginValueUser;
#endif // #if !BL_FEATURE_HAS_NO_INTERNAL_FLASH

#if BL_FEATURE_QSPI_MODULE
    propertyStore->qspiInitStatus = get_qspi_otfad_init_status();
#endif // BL_FEATURE_QSPI_MODULE

    return kStatus_Success;
}

// See property.h for documentation on this function.
status_t bootloader_property_get(uint8_t tag, uint32_t id, const void **value, uint32_t *valueSize)
{
    property_store_t *propertyStore = g_bootloaderContext.propertyInterface->store;
   
#if !BL_FEATURE_HAS_NO_INTERNAL_FLASH
//    uint32_t flashIndex = kFlashIndex_Main;
    
